tutorials/fluid/concentricCylinders/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0.1 0)
    (-0.1 0 0)
    (0 -0.1 0)
    (0.1 0 0)
    (0 0.5 0)
    (-0.5 0 0)
    (0 -0.5 0)
    (0.5 0 0)

    (0 0.1 1)
    (-0.1 0 1)
    (0 -0.1 1)
    (0.1 0 1)
    (0 0.5 1)
    (-0.5 0 1)
    (0 -0.5 1)
    (0.5 0 1)
);

cells (10 16 1);

blocks
(
    hex (0 3 7 4 8 11 15 12) $cells simpleGrading (1 1 1)
    hex (1 0 4 5 9 8 12 13) $cells simpleGrading (1 1 1)
    hex (2 1 5 6 10 9 13 14) $cells simpleGrading (1 1 1)
    hex (3 2 6 7 11 10 14 15) $cells simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (-0.07071067811 0.07071067811 0)
    arc 1 2 (-0.07071067811 -0.07071067811 0)
    arc 2 3 (0.07071067811 -0.07071067811 0)
    arc 3 0 (0.07071067811 0.07071067811 0)
    arc 8 9  (-0.07071067811 0.07071067811 1)
    arc 9 10 (-0.07071067811 -0.07071067811 1)
    arc 10 11(0.07071067811 -0.07071067811 1)
    arc 11 8 (0.07071067811 0.07071067811 1)

    arc 4 5 (-0.35355339059 0.35355339059 0)
    arc 5 6 (-0.35355339059 -0.35355339059 0)
    arc 6 7 (0.35355339059 -0.35355339059 0)
    arc 7 4 (0.35355339059 0.35355339059 0)
    arc 12 13 (-0.35355339059 0.35355339059 1)
    arc 13 14 (-0.35355339059 -0.35355339059 1)
    arc 14 15 (0.35355339059 -0.35355339059 1)
    arc 15 12 (0.35355339059 0.35355339059 1)

);

defaultPatch
{
    name ends;
    type empty;
}

boundary
(
    inner
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }

    outer
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
